lesson4/taurus/test.yml
execution:
  - concurrency: 10 # 同時接続数
    ramp-up: 10s # ramp-up(concurrency数に到達するまでの)時間
    hold-for: 2m # 試験時間
    throughput: 130 # 最大スループット(RPS: Request per second)
    scenario: quick-test # シナリオ名

scenarios:
  quick-test:
    requests:
      - http://host.docker.internal?name=hoge&email=hoge@example.com

reporting:
  - module: console # 実行中の情報を表示
  - module: final-stats # サマリを表示
  - module: blazemeter # オンラインレポートを作成